solucion-problemas-bottom-up.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-29 Sat 18:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solución de problemas: Enfoque "de abajo hacia arriba"</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="erretres" />
</head>
<body>
<div id="content">
<h1 class="title">Solución de problemas: Enfoque "de abajo hacia arriba"</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgede4ae2">1. Solución de problemas: Enfoque "de abajo hacia arriba" (Bottom-up)</a>
<ul>
<li><a href="#org6df4b78">1.1. "De abajo hacia arriba" (Bottom-up)</a>
<ul>
<li><a href="#orgfd462cc">1.1.1. Enfoque "De abajo hacia arriba" (Bottom-up) patrones comunes</a></li>
<li><a href="#org424ca37">1.1.2. Ejemplo: Calculadora</a></li>
</ul>
</li>
<li><a href="#orgac91c5f">1.2. Referencias</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgede4ae2" class="outline-2">
<h2 id="orgede4ae2"><span class="section-number-2">1</span> Solución de problemas: Enfoque "de abajo hacia arriba" (Bottom-up)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6df4b78" class="outline-3">
<h3 id="org6df4b78"><span class="section-number-3">1.1</span> "De abajo hacia arriba" (Bottom-up)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>En un enfoque "de abajo hacia arriba" (Bottom-up) el análisis del problema comienza en el nivel más bajo posible</li>
</ul>


<ul class="org-ul">
<li>Partes individuales del sistema son implementadas</li>
</ul>


<ul class="org-ul">
<li>Estas partes se enlazan/conectan para formar componentes</li>
</ul>


<ul class="org-ul">
<li>Este proceso continúa hasta que se implementan todos los componentes del sistema</li>
</ul>
</div>


<div id="outline-container-orgfd462cc" class="outline-4">
<h4 id="orgfd462cc"><span class="section-number-4">1.1.1</span> Enfoque "De abajo hacia arriba" (Bottom-up) patrones comunes</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Cuando se utiliza el enfoque "de abajo hacia arriba", hay algunos patrones que podemos identificar:
</p>

<ul class="org-ul">
<li>La mayoría de los programas siguen el paradigma  acción-evento[0][1][2]:</li>
</ul>


<ul class="org-ul">
<li>Los usuarios suministran un evento y</li>
</ul>


<ul class="org-ul">
<li>Se ejecuta una secuencia de acciones en respuesta a ese evento</li>
</ul>


<ul class="org-ul">
<li>Los elementos de la interfaz de usuario pueden responder a un evento de diferentes maneras, dependiendo del contexto</li>
</ul>


<ul class="org-ul">
<li>Las declaraciones  "if-else" se utilizan para determinar el contexto y las funciones que se ejecutarán</li>
</ul>


<ul class="org-ul">
<li>Los controladores de eventos(Event-handlers) deben utilizar la información compartida entre los objetos de la interfaz de usuario</li>
</ul>


<ul class="org-ul">
<li>Para compartir ésta información existen las siguientes opciones: 

<ul class="org-ul">
<li>Variables globales explícitas</li>

<li>Un valor contenido en un objeto de la interfaz de usuario</li>

<li>Otro atributo de un objeto</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org424ca37" class="outline-4">
<h4 id="org424ca37"><span class="section-number-4">1.1.2</span> Ejemplo: Calculadora</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #d787d7; font-weight: bold;">class</span> Calculator <span style="color: #d787d7; font-weight: bold;">extends</span> React.Component <span style="color: #d787d7; font-weight: bold;">{</span>
  constructor<span style="color: #d787d7; font-weight: bold;">(</span>props<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">super(</span>props<span style="color: #d787d7; font-weight: bold;">)</span>;
    <span style="color: #d7875f; font-weight: bold;">this</span>.state = <span style="color: #d787d7; font-weight: bold;">{</span>
      currentVal: <span style="color: #87af5f;">"0"</span>,
      prevVal: <span style="color: #87af5f;">"0"</span>,
      formula: <span style="color: #87af5f;">""</span>,
      currentSign: <span style="color: #87af5f;">"pos"</span>,
      lastClicked: <span style="color: #87af5f;">""</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>;
    <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">....</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

  initialize<span style="color: #d787d7; font-weight: bold;">()</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d7875f; font-weight: bold;">this</span>.setState<span style="color: #d787d7; font-weight: bold;">({</span>
      currentVal: <span style="color: #87af5f;">"0"</span>,
      prevVal: <span style="color: #87af5f;">"0"</span>,
      formula: <span style="color: #87af5f;">""</span>,
      currentSign: <span style="color: #87af5f;">"pos"</span>,
      lastClicked: <span style="color: #87af5f;">""</span>,
      evaluated: <span style="color: #d7875f; font-weight: bold;">false</span>
    <span style="color: #d787d7; font-weight: bold;">})</span>;
  <span style="color: #d787d7; font-weight: bold;">}</span>

  handleDecimal<span style="color: #d787d7; font-weight: bold;">()</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.evaluated === <span style="color: #d7875f; font-weight: bold;">true</span><span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">... </span>
    <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>
      !<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"."</span><span style="color: #d787d7; font-weight: bold;">)</span> &amp;&amp;
      !<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">)</span>
    <span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.length &gt; 21<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>
        endsWithOperator.test<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.formula<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">||</span>
        <span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal === <span style="color: #87af5f;">"0"</span> &amp;&amp; <span style="color: #d7875f; font-weight: bold;">this</span>.state.formula === <span style="color: #87af5f;">""</span><span style="color: #d787d7; font-weight: bold;">)</span>
      <span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
   <span style="color: #d787d7; font-weight: bold;">}</span>

  handleEvaluate<span style="color: #d787d7; font-weight: bold;">()</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #707070; font-style: italic;">//   </span><span style="color: #707070; font-style: italic;">...</span>
        expression = expression.replace<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">/x/</span>g, <span style="color: #87af5f;">"*"</span><span style="color: #d787d7; font-weight: bold;">)</span>.replace<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">/&#8209;/</span>g, <span style="color: #87af5f;">"-"</span><span style="color: #d787d7; font-weight: bold;">)</span>;

     <span style="color: #d787d7; font-weight: bold;">while</span> <span style="color: #d787d7; font-weight: bold;">(</span>endsWithOperator.test<span style="color: #d787d7; font-weight: bold;">(</span>expression<span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
        expression = expression.slice<span style="color: #d787d7; font-weight: bold;">(</span>0, -1<span style="color: #d787d7; font-weight: bold;">)</span>;
      <span style="color: #d787d7; font-weight: bold;">}</span>
    <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

  handleOperators<span style="color: #d787d7; font-weight: bold;">(</span>e<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>evaluated<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!endsWithOperator.test<span style="color: #d787d7; font-weight: bold;">(</span>formula<span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!endsWithNegativeSign.test<span style="color: #d787d7; font-weight: bold;">(</span>formula<span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>value !== <span style="color: #87af5f;">"&#8209;"</span><span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
      <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

  handleNumbers<span style="color: #d787d7; font-weight: bold;">(</span>e<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
    <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>!<span style="color: #d7875f; font-weight: bold;">this</span>.state.currentVal.includes<span style="color: #d787d7; font-weight: bold;">(</span><span style="color: #87af5f;">"Limit"</span><span style="color: #d787d7; font-weight: bold;">))</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>currentVal.length &gt; 21<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">... </span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">if</span> <span style="color: #d787d7; font-weight: bold;">(</span>evaluated<span style="color: #d787d7; font-weight: bold;">)</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
      <span style="color: #d787d7; font-weight: bold;">}</span> <span style="color: #d787d7; font-weight: bold;">else</span> <span style="color: #d787d7; font-weight: bold;">{</span>
     <span style="color: #707070; font-style: italic;">// </span><span style="color: #707070; font-style: italic;">...</span>
    <span style="color: #d787d7; font-weight: bold;">}</span>
   <span style="color: #d787d7; font-weight: bold;">}</span>
  <span style="color: #d787d7; font-weight: bold;">}</span>

<span style="color: #d787d7; font-weight: bold;">}</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgac91c5f" class="outline-3">
<h3 id="orgac91c5f"><span class="section-number-3">1.2</span> Referencias</h3>
<div class="outline-text-3" id="text-1-2">
<p>
[0] <a href="https://en.wikipedia.org/wiki/Event-driven_programming">https://en.wikipedia.org/wiki/Event-driven_programming</a>
</p>

<blockquote>
<p>
In computer programming, event-driven programming is a programming paradigm in which the flow of the program is determined by events such as user actions (mouse clicks, key presses), sensor outputs, or messages from other programs or threads. Event-driven programming is the dominant paradigm used in graphical user interfaces and other applications (e.g., JavaScript web applications) that are centered on performing certain actions in response to user input. This is also true of programming for device drivers (e.g., P in USB device driver stacks). 
</p>
</blockquote>

<p>
[1] <a href="https://en.wikipedia.org/wiki/Event-driven_programming#Criticism">https://en.wikipedia.org/wiki/Event-driven_programming#Criticism</a>
</p>

<blockquote>
<p>
The design of those programs which rely on event-action model has been criticised, and it has been suggested that the event-action model leads programmers to create error-prone, difficult to extend and excessively complex application code. Table-driven state machines have been advocated as a viable alternative. On the other hand, table-driven state machines themselves suffer from significant weaknesses including state explosion phenomena. A solution for this is to use Petri nets. 
</p>
</blockquote>


<p>
[2] Constructing the User Interface with Statecharts, Ian Horrocks, 1999.  ISBN-10: 0201342782
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: erretres</p>
<p class="date">Created: 2020-08-29 Sat 18:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
